In [1]:
2+2

4

In [2]:
2+6

8

In [43]:
import numpy as np
import pandas as pd

In [9]:
content = pd.read_csv('revenue-profit.csv' , sep = ';')

In [10]:
content

   no_data  Revenue    Cost  Profit
0     2010      100  -90.00   10.00
1     2011      120 -105.60   14.40
2     2012      130 -114.40   15.60
3     2013      233 -207.37   25.63
4     2014      255 -221.85   33.15
5     2015      179 -152.15   26.85
6     2016      300 -246.00   54.00
7     2017      320 -268.80   51.20

In [11]:
type(content)

pandas.core.frame.DataFrame

In [15]:
content.head(6)

   no_data  Revenue    Cost  Profit
0     2010      100  -90.00   10.00
1     2011      120 -105.60   14.40
2     2012      130 -114.40   15.60
3     2013      233 -207.37   25.63
4     2014      255 -221.85   33.15
5     2015      179 -152.15   26.85

In [19]:
content = content.rename(columns = {'no_data': 'Year'})

In [21]:
single_year = content[content.Year==2012]

In [22]:
single_year

   Year  Revenue   Cost  Profit
2  2012      130 -114.4    15.6

In [27]:
single_column = content[['Revenue','Profit']]

In [28]:
single_column

   Revenue  Profit
0      100   10.00
1      120   14.40
2      130   15.60
3      233   25.63
4      255   33.15
5      179   26.85
6      300   54.00
7      320   51.20

In [51]:
content.head(6)

AttributeError: 'numpy.int64' object has no attribute 'head'

In [45]:
import matplotlib.pyplot as plt
%matplotlib inline